run/icoPhaseChangeVoF/testGreyBodyRadiation/0/divU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      divU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    left
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    right
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    bottom
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
