run/icoPhaseChangeVoF/testGreyBodyRadiation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue T 300
);

regions
(
    boxToCell
    {
    	box (-1 -1 -1) (1 0.0002 1);
    	fieldValues
    	(
    	    volScalarFieldValue alpha.water 1
            volScalarFieldValue T 800
    	);
    }
);

// ************************************************************************* //